RodinWang/STM32F746_DISCO_Practice/Lecture1-UART_And_LCD/UART_LCD_Practice/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stm32746g_discovery.h"
#include "stm32746g_discovery_lcd.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define FONT_HEIGHT 20
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/


TIM_HandleTypeDef htim3;

UART_HandleTypeDef huart1;


/* USER CODE BEGIN PV */
Mode_TypeDef Mode = MODE_1;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_TIM3_Init(void);
/* USER CODE BEGIN PFP */
// initialize 
void LED_Init(void);
void Button_Init(void);
void LCD_Clear(void);
void LCD_Init(void);

void LED_1s_Blink(void);

// timer
void Start_100ms_Timer(void);
void Stop_100ms_Timer(void);

// button 
uint32_t IsButtonPressed(void);

// UART 
uint32_t ReceiveCharFromUART(void);
void UART_RX_Enable(void);
void UART_TX_Enable(void);
void UART_Disable(void);

// change Mode
void GoToMode1(void);
void GoToMode2(void);

// LCD Print
void PrintStartAtXY(uint32_t x, uint32_t y);
void PrintEndAtXY(uint32_t x, uint32_t y);
void PrintNumberAtXY(uint32_t x, uint32_t y, uint32_t Number);
void PrintModeAtXY(uint32_t x, uint32_t y);

// Count Down Function
void StartCountDown(uint32_t Time);


/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

// LED initialize
void LED_Init(void)
{
	BSP_LED_Init(LED1);
	BSP_LED_Off(LED1);
}

// Button initialize
void Button_Init(void)
{
	BSP_PB_Init(BUTTON_KEY, BUTTON_MODE_GPIO);
}

// clear LCD
void LCD_Clear(void)
{
	BSP_LCD_Clear(LCD_COLOR_WHITE);
	BSP_LCD_DisplayStringAt(0, 250, (uint8_t *)"UART And LCD B10602225", CENTER_MODE);
	PrintModeAtXY(0, 0);
}

// LCD initialize
void LCD_Init(void)
{
	BSP_LCD_Init();
	BSP_LCD_LayerDefaultInit(0,LCD_FB_START_ADDRESS);
	LCD_Clear();
}

// LED Blink
void LED_1s_Blink(void)
{
	BSP_LED_On(LED1);
	HAL_Delay(500);
	BSP_LED_Off(LED1);
	HAL_Delay(500);
}

// Start LED Blink Timer
void Start_100ms_Timer(void)
{
	HAL_TIM_Base_Start_IT(&htim3);
}

// Stop LED Blink Timer
void Stop_100ms_Timer(void)
{
	HAL_TIM_Base_Stop_IT(&htim3);
}

// Check Button
uint32_t IsButtonPressed(void)
{
	uint32_t Pressed = 0;
	static uint32_t PrvBtnState = RESET;
	uint32_t CurrentBtnState = BSP_PB_GetState(BUTTON_KEY);;
	
	if (PrvBtnState == SET && CurrentBtnState == RESET){
		Pressed = 1;
	}
	
	PrvBtnState = CurrentBtnState;
	return Pressed;
}

// Receive UART
uint32_t ReceiveCharFromUART(void)
{
	uint8_t aRxBuffer[10];
	if (HAL_UART_Receive(&huart1, (uint8_t *)aRxBuffer, 1, 10) == HAL_OK){
		return aRxBuffer[0];
	}
	return 0;
}

// operation to Change MODE 1
void GoToMode1(void)
{
	Mode = MODE_1;	
	Start_100ms_Timer();
	LCD_Clear();
	UART_Disable();
	PrintModeAtXY(0, 0);
}

// operation to Change MODE 2
void GoToMode2(void)
{
	Mode = MODE_2;
	Stop_100ms_Timer();
	BSP_LED_Off(LED1);
	UART_RX_Enable();
	PrintModeAtXY(0, 0);
}

// Print current Mode
void PrintModeAtXY(uint32_t x, uint32_t y)
{
	uint8_t PrintBuffer[10];
	PrintBuffer[0] = 'M';
	PrintBuffer[1] = 'o';
	PrintBuffer[2] = 'd';
	PrintBuffer[3] = 'e';
	PrintBuffer[4] = ':';
	PrintBuffer[5] = '0' + Mode;
	BSP_LCD_DisplayStringAt(x, y, PrintBuffer,LEFT_MODE);
}

// print start at (x, y)
void PrintStartAtXY(uint32_t x, uint32_t y)
{
	HAL_UART_Transmit(&huart1, (uint8_t *)"Start\r\n", 7, 500);
	BSP_LCD_DisplayStringAt(x, y,(uint8_t *)"Start",CENTER_MODE);
}

// print end at (x, y)
void PrintEndAtXY(uint32_t x, uint32_t y)
{
	HAL_UART_Transmit(&huart1, (uint8_t *)"End\r\n", 5, 500);
	BSP_LCD_DisplayStringAt(x, y,(uint8_t *)"End",CENTER_MODE);
}

// print number at (x, y)
void PrintNumberAtXY(uint32_t x, uint32_t y, uint32_t Number)
{
	uint8_t TransmitBuffer[3];
	TransmitBuffer[0] = Number + '0';
	TransmitBuffer[1] = '\r';
	TransmitBuffer[2] = '\n';
	HAL_UART_Transmit(&huart1, (uint8_t *)TransmitBuffer, 3, 500);
	TransmitBuffer[1] = '\0';
	BSP_LCD_DisplayStringAt(x, y,(uint8_t *)TransmitBuffer,CENTER_MODE);
}

// count down function
void StartCountDown(uint32_t Time)
{
	uint32_t xAxis = 0;
	uint32_t yAxis = 0;
	
	PrintStartAtXY(xAxis, yAxis);
	yAxis += FONT_HEIGHT;
	
	while (Time > 0){
		Time--;
		PrintNumberAtXY(xAxis, yAxis, Time);
		yAxis += FONT_HEIGHT;
		LED_1s_Blink();
	}
	PrintEndAtXY(xAxis, yAxis);
}

// UART enable RX
void UART_RX_Enable(void)
{
	if (HAL_UART_Init(&huart1) != HAL_OK)
  {
    Error_Handler();
  }
	HAL_HalfDuplex_EnableReceiver(&huart1);
}

// UART enable TX
void UART_TX_Enable(void)
{
	if (HAL_UART_Init(&huart1) != HAL_OK)
  {
    Error_Handler();
  }
	HAL_HalfDuplex_EnableTransmitter(&huart1);
}

// UART disable
void UART_Disable(void)
{
	HAL_UART_DeInit(&huart1);
	
